{
  "backend/main.mo": "Main backend actor defining user profiles, game state types, access control, and profile query/save methods.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "List of concise summaries for key frontend source files across components, pages, and hooks.",
  "frontend/index.css": "Tailwind base/theme configuration defining OKLCH color variables for light and dark modes.",
  "frontend/index.html": "Base HTML file bootstrapping the frontend and loading the main React entry script.",
  "frontend/src/App.tsx": "Main React app routing setup using TanStack Router with puzzle pages and layout wrapper.",
  "frontend/src/components/AppLayout.tsx": "Shared layout with header, navigation, coin display, auth status, main content slot, and footer.",
  "frontend/src/components/AuthStatus.tsx": "Component handling Internet Identity login state, sign-in/out UI, and principal display.",
  "frontend/src/components/ModeTile.tsx": "Reusable tile component showing a puzzle mode with icon, description, and best score.",
  "frontend/src/components/RequireSignInDialog.tsx": "Dialog prompting users to sign in before saving best puzzle scores through Internet Identity.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useBattle.ts": "Fetches battle stats and saves battle wins by interacting with backend game APIs.",
  "frontend/src/hooks/useCarRacing.ts": "Loads and updates the player's best car racing time through backend game calls.",
  "frontend/src/hooks/useCityBuilder.ts": "Handles saving and loading simplified city layout data through backend profile updates.",
  "frontend/src/hooks/useFarming.ts": "Saves farm plot states, handles harvest updates, and loads stored farm data from the backend.",
  "frontend/src/hooks/useGameProgress.ts": "Saves generic game progress by starting, updating, and ending backend game sessions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout handling, and identity persistence using AuthClient.",
  "frontend/src/hooks/usePlayerProfile.ts": "Fetches and returns the player's profile data using the authenticated actor.",
  "frontend/src/hooks/usePuzzleBestScores.ts": "Saves best puzzle scores by running a backend game session update.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles, variables, themes, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/pages/HubPage.tsx": "Displays the puzzle hub UI, showing puzzle modes and best scores with navigation links.",
  "frontend/src/pages/LeaderboardPage.tsx": "Renders a leaderboard UI with tabs for different game modes using mock leaderboard data. Displays ranked players with icons for top positions.",
  "frontend/src/pages/modes/BattlePage.tsx": "Implements a turn‑based battle system with player/enemy actions, win/loss states, and stat saving. Includes UI for HP bars, actions, and battle feedback.",
  "frontend/src/pages/modes/CarPage.tsx": "Creates a simple racing minigame with progress tracking, car movement via arrow keys, and best‑time saving. Uses an animation loop to advance the race.",
  "frontend/src/pages/modes/CityBuilderPage.tsx": "Provides a 5x5 grid city‑building interface where players place structures costing coins and persist their layout. Loads saved cities and handles placement validation.",
  "frontend/src/pages/modes/EndlessRunPage.tsx": "Runs an endless runner game that spawns obstacles, tracks score, detects collisions, and saves progress. Supports jumping via keyboard input.",
  "frontend/src/pages/modes/FarmingPage.tsx": "Implements a farming grid where crops can be planted, grow over time, and be harvested for rewards. Persists farm state and updates growth with timers.",
  "frontend/src/pages/modes/indoor/PuzzleGame.tsx": "Implements a 3x3 sliding puzzle with move tracking, win detection, scoring, and progress saving.",
  "frontend/src/pages/modes/indoor/ReactionGame.tsx": "Runs a timed reaction‑click game with multiple rounds, scoring based on reaction time, and progress saving.",
  "frontend/src/pages/modes/IndoorPage.tsx": "Renders the indoor games hub with navigation and lets users launch either the Reaction or Puzzle mini‑games.",
  "frontend/src/pages/puzzles/LightsOutPage.tsx": "Provides a 5x5 Lights Out puzzle with solvable random setups, move tracking, scoring, and optional sign‑in for saving scores.",
  "frontend/src/pages/puzzles/MemoryMatchPage.tsx": "Implements a memory‑match card game with paired symbols, move tracking, completion detection, and score saving when signed in.",
  "frontend/src/pages/puzzles/SlidingTilesPage.tsx": "Hosts a shuffled 3x3 sliding‑tile puzzle with move tracking, solution detection, and score saving support.",
  "frontend/src/pages/puzzles/SudokuMiniPage.tsx": "Implements a 4x4 Sudoku minigame with puzzle generation, user input, mistake tracking, scoring, and optional score saving for signed‑in users.",
  "frontend/src/pages/puzzles/WordScramblePage.tsx": "Provides a word‑scramble guessing game with randomized words, attempt limits, scoring, and best‑score saving when signed in.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, storing, and clearing URL and session‑persisted parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and layout settings for the project’s UI theme.",
  "project_state.json": "Tracks project metadata, features, requirements, and asset needs for the PS PUZZLE game."
}