{
  "backend/main.mo": "Defines player profiles, game modes, structures, crops, and persistent game state with functions to create/update player data and manage game runs.",
  "feature_evidence.json": "Lists implemented features, related source files, components, and test mappings for the Metablocks project.",
  "frontend-file-summaries.txt": "Contains prewritten one-line summaries for all frontend source files.",
  "frontend/index.css": "Defines Tailwind base styles and custom OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point loading the React application root and main script.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with all game mode routes and wraps the app with theme and toast providers.",
  "frontend/src/components/AppLayout.tsx": "Provides the global layout with header, navigation, coin display, auth status, and footer.",
  "frontend/src/components/AuthStatus.tsx": "Displays sign-in state using Internet Identity with login/logout controls.",
  "frontend/src/components/ModeTile.tsx": "Reusable card component showing a game mode tile with icon, description, and optional best score.",
  "frontend/src/components/RequireSignInDialog.tsx": "Dialog prompting users to sign in before accessing features that require authentication.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useBattle.ts": "Provides battle stats fetching and a mutation to record a win by running a full game lifecycle on the backend.",
  "frontend/src/hooks/useCarRacing.ts": "Fetches the player’s best racing time and saves new times through game lifecycle calls.",
  "frontend/src/hooks/useCityBuilder.ts": "Handles saving and loading simplified city layout data using the backend’s player data API.",
  "frontend/src/hooks/useFarming.ts": "Manages saving farm plots, harvesting crops, and loading farm data via player data APIs.",
  "frontend/src/hooks/useGameProgress.ts": "Saves generic game progress by running start, update, and end lifecycle calls for any game mode.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, stored identities, and status tracking.",
  "frontend/src/hooks/usePlayerProfile.ts": "Fetches the authenticated player’s profile from the backend with react-query caching.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode values, and global typography.",
  "frontend/src/main.tsx": "Bootstraps the app with React, providing query and identity providers before rendering App.",
  "frontend/src/pages/HubPage.tsx": "Displays the main game hub with mode tiles, sign‑in gating, and links to game routes using player profile data.",
  "frontend/src/pages/LeaderboardPage.tsx": "Renders a tabbed leaderboard UI showing mock ranking data for each game mode.",
  "frontend/src/pages/modes/BattlePage.tsx": "Implements a turn-based battle game with player/enemy actions, win tracking, and UI for stats and combat controls.",
  "frontend/src/pages/modes/CarPage.tsx": "Provides a racing mini‑game with progress tracking, keyboard car movement, and best‑time saving.",
  "frontend/src/pages/modes/CityBuilderPage.tsx": "Implements a grid-based city builder where players place structures using coins and save/load city layouts.",
  "frontend/src/pages/modes/EndlessRunPage.tsx": "Creates an endless runner where the player jumps to avoid obstacles, earning score and coins on game over.",
  "frontend/src/pages/modes/FarmingPage.tsx": "Manages a farming grid where players plant, grow, and harvest crops with timers and persistence.",
  "frontend/src/pages/modes/indoor/PuzzleGame.tsx": "Implements a sliding‑tile 3x3 puzzle minigame with move counting, scoring, and saving progress to the backend.",
  "frontend/src/pages/modes/indoor/ReactionGame.tsx": "Implements a reaction‑time minigame with timed rounds, scoring based on click speed, and backend score saving.",
  "frontend/src/pages/modes/IndoorPage.tsx": "Acts as a menu switching between reaction and puzzle indoor mini‑games.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, animations, typography, and container settings for the frontend.",
  "project_state.json": "Describes overall project state, features, requirements, and image assets for the Metablocks game."
}