{
  "kind": "build_request",
  "title": "Restore Metablocks as the primary app experience",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "Replace the current '/' hub experience with a Metablocks hub that lets the user choose between these game modes: Endless Run, City Builder, Farming, Indoor (minigames), Car Racing, and Battle.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Recreate metablocks"
        ]
      },
      "acceptanceCriteria": [
        "Visiting '/' shows a Metablocks-branded hub (not PS PUZZLE).",
        "The hub displays 6 clear mode tiles: Endless Run, City Builder, Farming, Indoor, Car Racing, Battle.",
        "Clicking each tile navigates to the corresponding playable mode page."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Update routing so Metablocks mode pages are first-class routes in the app router and are reachable from the Metablocks hub.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Recreate metablocks"
        ]
      },
      "acceptanceCriteria": [
        "The router includes routes for Endless Run, City Builder, Farming, Indoor, Car Racing, and Battle pages under a consistent URL scheme.",
        "No navigation from the Metablocks hub results in a 404 or blank page.",
        "The existing '/leaderboard' route remains accessible from the hub."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Rebrand all primary UI chrome from PS PUZZLE back to Metablocks (header title, hub hero heading, and any prominent hub taglines) using English user-facing text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Recreate metablocks"
        ]
      },
      "acceptanceCriteria": [
        "The header in the shared layout displays \"Metablocks\" instead of \"PS PUZZLE\".",
        "The main hub hero section displays \"Metablocks\" branding instead of \"PS PUZZLE\".",
        "No prominent PS PUZZLE branding remains on the primary hub or layout header."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Add and render Metablocks static branding assets from frontend/public/assets/generated, including a logo, hub background, and one icon per Metablocks mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Recreate metablocks"
        ]
      },
      "acceptanceCriteria": [
        "Metablocks hub uses a Metablocks logo image from /assets/generated.",
        "Metablocks hub uses a Metablocks background image from /assets/generated.",
        "Each of the 6 hub tiles uses a mode icon image from /assets/generated.",
        "No PS PUZZLE logo/background/icons are used on the Metablocks hub."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not edit files under frontend/src/components/ui or any other frontend immutablePaths; compose existing UI components instead.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Do not remove or rewrite the existing PS PUZZLE puzzle pages unless required for routing consistency.",
    "Do not add third-party authentication providers (Internet Identity only).",
    "Do not introduce external databases or additional backend services."
  ],
  "imageRequirements": {
    "required": [
      "Metablocks logo, bold futuristic block-themed emblem (metablocks-logo.dim_512x512.png)",
      "Wide Metablocks hub background illustration, neon/arcade block cityscape (metablocks-hub-bg.dim_1920x1080.png)",
      "Mode icon illustration, endless runner (icon-mode-endless-run.dim_256x256.png)",
      "Mode icon illustration, city builder (icon-mode-city-builder.dim_256x256.png)",
      "Mode icon illustration, farming (icon-mode-farming.dim_256x256.png)",
      "Mode icon illustration, indoor minigames (icon-mode-indoor.dim_256x256.png)",
      "Mode icon illustration, car racing (icon-mode-car.dim_256x256.png)",
      "Mode icon illustration, battle/combat (icon-mode-battle.dim_256x256.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}