{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Metablocks hub restore and routing",
  "requirements": [
    {
      "id": "REQ-19",
      "summary": "Replace the '/' hub with a Metablocks hub featuring 6 selectable game modes that navigate to playable mode pages.",
      "acceptanceCriteria": [
        "Visiting '/' shows a Metablocks-branded hub (not PS PUZZLE).",
        "The hub displays 6 clear mode tiles: Endless Run, City Builder, Farming, Indoor, Car Racing, Battle.",
        "Clicking each tile navigates to the corresponding playable mode page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HubPage.tsx",
          "operation": "modify",
          "description": "Rework the existing hub content from puzzle-focused to Metablocks-focused: render 6 mode tiles (Endless Run, City Builder, Farming, Indoor, Car Racing, Battle) and wire tile clicks to the new mode routes. Continue composing existing shadcn-ui Button and the existing ModeTile component (do not modify immutable UI components); verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Add first-class router routes for Metablocks mode pages with a consistent URL scheme and ensure hub navigation (including leaderboard) works.",
      "acceptanceCriteria": [
        "The router includes routes for Endless Run, City Builder, Farming, Indoor, Car Racing, and Battle pages under a consistent URL scheme.",
        "No navigation from the Metablocks hub results in a 404 or blank page.",
        "The existing '/leaderboard' route remains accessible from the hub."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register Metablocks mode routes in the TanStack Router (e.g., under a consistent '/modes/*' scheme) and map them to the existing playable mode pages: EndlessRunPage, CityBuilderPage, FarmingPage, IndoorPage, CarPage, BattlePage. Keep existing puzzle routes intact and ensure '/leaderboard' remains registered and reachable."
        },
        {
          "path": "frontend/src/pages/HubPage.tsx",
          "operation": "modify",
          "description": "Update hub navigation targets so each Metablocks mode tile navigates to the corresponding first-class router route and the Leaderboard button continues navigating to '/leaderboard'. Continue composing existing shadcn-ui Button; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Rebrand primary UI chrome from PS PUZZLE to Metablocks in the shared layout header and the hub hero area using English text.",
      "acceptanceCriteria": [
        "The header in the shared layout displays \"Metablocks\" instead of \"PS PUZZLE\".",
        "The main hub hero section displays \"Metablocks\" branding instead of \"PS PUZZLE\".",
        "No prominent PS PUZZLE branding remains on the primary hub or layout header."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Change the header title text from \"PS PUZZLE\" to \"Metablocks\" and ensure any prominent header branding reflects Metablocks. Continue using composed shadcn-ui Button; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HubPage.tsx",
          "operation": "modify",
          "description": "Update the hub hero heading/tagline copy to Metablocks branding in English and remove/replace any prominent PS PUZZLE hero text. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Add and render Metablocks static branding assets (logo, hub background, and one icon per mode) from frontend/public/assets/generated.",
      "acceptanceCriteria": [
        "Metablocks hub uses a Metablocks logo image from /assets/generated.",
        "Metablocks hub uses a Metablocks background image from /assets/generated.",
        "Each of the 6 hub tiles uses a mode icon image from /assets/generated.",
        "No PS PUZZLE logo/background/icons are used on the Metablocks hub."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HubPage.tsx",
          "operation": "modify",
          "description": "Swap hub hero artwork to Metablocks assets and ensure tiles use Metablocks mode icons: use frontend/public/assets/generated/metablocks-logo.dim_512x512.png for the hub logo, frontend/public/assets/generated/metablocks-hub-bg.dim_1920x1080.png for the hub background, and frontend/public/assets/generated/icon-endless-run.dim_256x256.png, frontend/public/assets/generated/icon-city-builder.dim_256x256.png, frontend/public/assets/generated/icon-farming.dim_256x256.png, frontend/public/assets/generated/icon-indoor.dim_256x256.png, frontend/public/assets/generated/icon-car.dim_256x256.png, frontend/public/assets/generated/icon-battle.dim_256x256.png for the 6 mode tiles. Remove any usage of PS PUZZLE assets on the hub. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}